IDENTIFICATION DIVISION.
PROGRAM-ID. FINANCIAL-ACCOUNTING-I.

DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 REVENUE      PIC S9(9).
       01 EXPENSES     PIC S9(9).
       01 NETVALUE     PIC S9(9).

PROCEDURE DIVISION.
       DISPLAY "Enter Revenue".
       ACCEPT REVENUE.
       DISPLAY "Enter Expenses".
       ACCEPT EXPENSES.
       SUBTRACT EXPENSES FROM REVENUE GIVING NETVALUE.
       IF EXPENSES > REVENUE THEN
        DISPLAY "Net Loss: "NETVALUE
       ELSE
        DISPLAY "Net Income: "NETVALUE
       END-IF.

STOP RUN.
