IDENTIFICATION DIVISION.
PROGRAM-ID. FINANCIAL-ACCOUNTING-I.

DATA DIVISION.
        WORKING-STORAGE SECTION.
        01 REVENUE      PIC 9(10).
        01 EXPENSES     PIC 9(10).
        01 NETVALUE     PIC 9(10).

PROCEDURE DIVISION.
           DISPLAY "Enter Revenue".
           ACCEPT REVENUE
           DISPLAY "Enter Expenses".
           ACCEPT EXPENSES
           SUBTRACT EXPENSES FROM REVENUE GIVING NETVALUE
           DISPLAY "Net Value : "NETVALUE

STOP RUN.
